import { Categories, Period } from "../types/dataTypes";

// Описываются какие есть периоды и их порядок
export const numbersByMonths = new Map<Period, number>([
    ["Январь", 1],
    ["Февраль", 2],
    ["Март", 3],
    ["Апрель", 4],
    ["Май", 5],
    ["Июнь", 6],
    ["Июль", 7],
    ["Август", 8],
    ["Сентябрь", 9],
    ["Октябрь", 10],
    ["Ноябрь", 11],
    ["Декабрь", 12],
]);

export const monthsByNumbers = new Map<number, Period>([
    [1, "Январь"],
    [2, "Февраль"],
    [3, "Март"],
    [4, "Апрель"],
    [5, "Май"],
    [6, "Июнь"],
    [7, "Июль"],
    [8, "Август"],
    [9, "Сентябрь"],
    [10, "Октябрь"],
    [11, "Ноябрь"],
    [12, "Декабрь"],
])

// Описываются категории
export const categories: Array<Categories> = [
    "В программе ЦП",
    "В программе ИТ",
    "Вне программ ЦП",
    "Вне программ ИТ"
];